//
// GCC 4.5
// Xcode Compiler Specification
// English localization
//
// Copyright (c) 2008-2009 Apple Inc.  All rights reserved.
//

// Localized strings for basic info

"Name" = "GCC 4.5";
"Description" = "GNU C/C++ コンパイラ 4.5";
"Version" = "4.5";
"Vendor" = "Apple";

// Localized strings for compiler options

"[Preprocessing]-category" = "プリプロセス";

"[GCC_PREPROCESSOR_DEFINITIONS]-name" = "プリプロセッサマクロ";
"[GCC_PREPROCESSOR_DEFINITIONS]-description" = "\"foo\" または \"foo=bar\" という形式のプリプロセッサマクロのスペース区切りのリストです。[GCC_PREPROCESSOR_DEFINITIONS, -D]";

"[GCC_PREPROCESSOR_DEFINITIONS_NOT_USED_IN_PRECOMPS]-name" = "プリコンパイルされたヘッダに使用しないプリプロセッサマクロ";
"[GCC_PREPROCESSOR_DEFINITIONS_NOT_USED_IN_PRECOMPS]-description" = "\"foo\"または\"foo=bar\"という形式のプリプロセッサマクロのスペース区切りのリストです。プレフィックス・ヘッダ・ファイルをプリコンパイルするときに、これらのマクロが使用されません。[GCC_PREPROCESSOR_DEFINITIONS_NOT_USED_IN_PRECOMPS, -D]";


"[Language]-category" = "言語";

"[GCC_INPUT_FILETYPE]-name" = "コンパイルでのソースの解釈";
"[GCC_INPUT_FILETYPE]-description" = "各ソースファイルをファイルタイプに基づいてコンパイルするか、またはターゲットのすべてのソースファイルを特定の言語のファイルとして取り扱うかを指定します。[GCC_INPUT_FILETYPE]";
"[GCC_INPUT_FILETYPE]-value-[automatic]" = "ファイルタイプに基づいて";
"[GCC_INPUT_FILETYPE]-value-[sourcecode.c.c]" = "C";
"[GCC_INPUT_FILETYPE]-value-[sourcecode.c.objc]" = "Objective-C";
"[GCC_INPUT_FILETYPE]-value-[sourcecode.cpp.cpp]" = "C++";
"[GCC_INPUT_FILETYPE]-value-[sourcecode.cpp.objcpp]" = "Objective C++";

"[GCC_USE_STANDARD_INCLUDE_SEARCHING]-name" = "標準システムヘッダディレクトリ検索を使用";
"[GCC_USE_STANDARD_INCLUDE_SEARCHING]-description" = "標準システムディレクトリのヘッダファイルを検索するかどうかを制御します。無効にすると、-I オプションで指定したディレクトリ（および、該当する場合は、現在のファイルのディレクトリ）だけを検索します。  [GCC_USE_STANDARD_INCLUDE_SEARCHING, -nostdinc]";
"[GCC_USE_STANDARD_INCLUDE_SEARCHING]-value-[NO]" = "いいえ";
"[GCC_USE_STANDARD_INCLUDE_SEARCHING]-value-[YES]" = "はい";

"[GCC_C_LANGUAGE_STANDARD]-name" = "C 言語ファミリー";
"[GCC_C_LANGUAGE_STANDARD]-description" = "標準または非標準の C 言語ファミリーを選択します。

ANSI C：ISO C90 と ISO C++ を含み、非互換の GNU 拡張は無効になります。[-ansi]

非互換の GNU 拡張には、‘asm’、‘inline’、‘typeof’キーワード（ただし、等価の __asm__、__inline__、__typeof__ 形式を除く）、コメントの‘//’構文などがあります。

この設定では、trigraph（3 文字表記）も有効になります。

C89：ISO C90 を含みますが、GNU 拡張は含みません。[-std=c89]

GNU89：ISO C90 と GNU 拡張を含みます。[-std=gnu89]

C99：ISO C99 を含みますが、GNU 拡張は含みません。[-std=c99]

GNU99：ISO C99 と GNU 拡張を含みます。[-std=gnu99]

コンパイラのデフォルト：そのコンパイラのデフォルトの C 言語ファミリーを使うように指示します。特別の必要がない限り、通常は、これが最善の選択です（現在は“GNU89”と等価）。

C 言語ファミリーに関するこれらの設定の詳細な定義については、次の完全な GCC マニュアルを参照してください：
<http://developer.apple.com/documentation/DeveloperTools/gcc-4.2.1/gcc/C-Dialect-Options.html>

[GCC_C_LANGUAGE_STANDARD]";
"[GCC_C_LANGUAGE_STANDARD]-value-[ansi]" = "ANSI C [-ansi]";
"[GCC_C_LANGUAGE_STANDARD]-description-[ansi]" = "ISO C90 および ISO C++ を受け入れ、互換性のない GNU 機能拡張を切にします。  [-ansi]";
"[GCC_C_LANGUAGE_STANDARD]-value-[c89]" = "C89 [-std=c89]";
"[GCC_C_LANGUAGE_STANDARD]-description-[c89]" = "ISO C90 は受け入れますが、GNU 機能拡張は受け入れません。  [-std=c89]";
"[GCC_C_LANGUAGE_STANDARD]-value-[gnu89]" = "GNU89 [-std=gnu89]";
"[GCC_C_LANGUAGE_STANDARD]-description-[gnu89]" = "ISO C90 と GNU 機能拡張を受け入れます。  [-std=gnu89]";
"[GCC_C_LANGUAGE_STANDARD]-value-[c99]" = "C99 [-std=c99]";
"[GCC_C_LANGUAGE_STANDARD]-description-[c99]" = "ISO C99 を受け入れますが、GNU 機能拡張を受け入れません。  [-std=c99]";
"[GCC_C_LANGUAGE_STANDARD]-value-[gnu99]" = "GNU99 [-std=gnu99]";
"[GCC_C_LANGUAGE_STANDARD]-description-[gnu99]" = "ISO C99 と GNU 機能拡張を受け入れます。  [-std=gnu99]";
"[GCC_C_LANGUAGE_STANDARD]-value-[compiler-default]" = "コンパイラのデフォルト";
"[GCC_C_LANGUAGE_STANDARD]-description-[compiler-default]" = "デフォルトの C 言語ファミリーを使用することをコンパイラに指定します。通常は、特別に必要がない限り、このようにすることをお勧めします。（現在は GNU89 と同等です。）";

"[GCC_CHAR_IS_UNSIGNED_CHAR]-name" = "‘char’を符号なしにする";
"[GCC_CHAR_IS_UNSIGNED_CHAR]-description" = "この設定を有効にすると、デフォルトで‘char’が符号なしになります。無効にすると、デフォルトで‘char’が符号付きになります。[GCC_CHAR_IS_UNSIGNED_CHAR, -funsigned-char]";
"[GCC_CHAR_IS_UNSIGNED_CHAR]-value-[NO]" = "いいえ";
"[GCC_CHAR_IS_UNSIGNED_CHAR]-value-[YES]" = "はい";

"[GCC_ENABLE_ASM_KEYWORD]-name" = "‘asm’、‘inline’、および‘typeof’を許可する";
"[GCC_ENABLE_ASM_KEYWORD]-description" = "‘asm’、‘inline’、および‘typeof’をキーワードとして扱うかどうか、またはそれらを識別子として使用できるかどうかを制御します。[GCC_ENABLE_ASM_KEYWORD, -fno-asm]";
"[GCC_ENABLE_ASM_KEYWORD]-value-[NO]" = "いいえ";
"[GCC_ENABLE_ASM_KEYWORD]-value-[YES]" = "はい";

"[GCC_ENABLE_TRIGRAPHS]-name" = "3 文字表記を有効にする";
"[GCC_ENABLE_TRIGRAPHS]-description" = "ソースコードで 3 文字表記を許可するかどうかを制御します。[GCC_ENABLE_TRIGRAPHS, -trigraphs]";
"[GCC_ENABLE_TRIGRAPHS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_TRIGRAPHS]-value-[YES]" = "はい";

"[GCC_ENABLE_CPP_EXCEPTIONS]-name" = "C++ 例外を有効にする";
"[GCC_ENABLE_CPP_EXCEPTIONS]-description" = "C++ 例外処理を有効にします。例外の伝達に必要な追加コードを生成します。一部の言語では、GCC がすべての関数のフレーム展開情報を生成します。これにより、データサイズが大きくなって負荷が増えることがありますが、例外には影響しません。このオプションを指定しない場合、GCC は C++ などの通常は例外処理を必要とする言語についてはデフォルトで例外処理を有効にし、C などの通常は例外処理を必要としない言語については例外処理を無効にします。ただし、コンパイルした C コードと、C++ で記述された例外ハンドラが正しく相互運用させる必要がある場合は 、このオプションを有効にする必要があります。[GCC_ENABLE_CPP_EXCEPTIONS, -fno-exceptions]";
"[GCC_ENABLE_CPP_EXCEPTIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_CPP_EXCEPTIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_CPP_RTTI]-name" = "C++ 実行時タイプを有効にする";
"[GCC_ENABLE_CPP_RTTI]-description" = "C++ ランタイムデータ型識別機能（dynamic_cast と typeid）が使用するすべてのクラスと仮想関数の情報を生成することができます。その言語のそれらの機能を使用しない場合は、このフラグを使用して領域をいくらか節約できます。例外処理はこれらの情報を使用しますが、生成するかどうかは必要に応じてしてください。[GCC_ENABLE_CPP_RTTI, -fno-rtti]";
"[GCC_ENABLE_CPP_RTTI]-value-[NO]" = "いいえ";
"[GCC_ENABLE_CPP_RTTI]-value-[YES]" = "はい";

"[GCC_CHECK_RETURN_VALUE_OF_OPERATOR_NEW]-name" = "‘operator new’の戻り値を確認";
"[GCC_CHECK_RETURN_VALUE_OF_OPERATOR_NEW]-description" = "割り当てた領域を変更しようとする前に、“operator new”から返されるポインタが null でないことを確認してください。C++ の標準規格では、“operator new”で throw() を宣言している場合は 0 が返されるだけです。その場合は、このオプションを指定しなくてもコンパイラが必ず戻り値を確認するため、通常このチェックは不要です。それ以外の場合で、“operator new”に empty 以外の例外を指定しているときは、メモリ領域不足のシグナル送出は“std::bad_alloc”のスローによって行われます。 [GCC_CHECK_RETURN_VALUE_OF_OPERATOR_NEW, -fcheck-new]";
"[GCC_CHECK_RETURN_VALUE_OF_OPERATOR_NEW]-value-[NO]" = "いいえ";
"[GCC_CHECK_RETURN_VALUE_OF_OPERATOR_NEW]-value-[YES]" = "はい";

"[GCC_ENABLE_PASCAL_STRINGS]-name" = "Pascal 文字列を認識";
"[GCC_ENABLE_PASCAL_STRINGS]-description" = "Pascal スタイルの文字列リテラルを認識および構築します。新しいコードでの使用はお勧めできません。

	Pascal 文字列リテラルは \"\\pstring\" の形式になります。特別なエクケープシーケンス \\p は文字列の Pascal 長バイトを示し、コンパイル時に後続の文字の数に置き換えられます。\p は文字列リテラルの先頭にのみ表示することができ、広い文字列リテラルに表示したり、積分定数として表示したりすることはできません。  [GCC_ENABLE_PASCAL_STRINGS, -fpascal-strings]";
"[GCC_ENABLE_PASCAL_STRINGS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_PASCAL_STRINGS]-value-[YES]" = "はい";

"[GCC_SHORT_ENUMS]-name" = "short 型の列挙定数";
"[GCC_SHORT_ENUMS]-description" = "enum を取り得る値の範囲に必要な最小範囲にします。[GCC_SHORT_ENUMS, -fshort-enums]

警告：この設定を使用した生成されたコードは、この設定を使用しないで生成されたコードまたは Mac OS X フレームワークを使用して生成されたコードとのバイナリ互換性を持たないことがあります。";
"[GCC_SHORT_ENUMS]-value-[NO]" = "いいえ";
"[GCC_SHORT_ENUMS]-value-[YES]" = "はい";

"[GCC_ALTIVEC_EXTENSIONS]-name" = "AltiVec 機能拡張を有効にする";
"[GCC_ALTIVEC_EXTENSIONS]-description" = "Motorola 社が定義した AltiVec 言語機能拡張を有効にします。[GCC_ALTIVEC_EXTENSIONS, -faltivec]";
"[GCC_ALTIVEC_EXTENSIONS]-value-[NO]" = "いいえ";
"[GCC_ALTIVEC_EXTENSIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_BUILTIN_FUNCTIONS]-name" = "組み込み関数を認識";
"[GCC_ENABLE_BUILTIN_FUNCTIONS]-description" = "プレフィックスとして __builtin_ で始まらない組み込み関数を認識するかどうかを制御します。

GCC は通常、特定の組み込み関数をより効率的に処理する特別なコードを生成します。たとえば、“alloca”の呼び出しは、直接スタックを調整する単独の命令になることができ、“memcpy”の呼び出しはインラインのコピーループになることができます。生成されるコードはしばしばより小さく高速になりますが、関数呼び出しはそのようには表示されなくなるので、それらの呼び出しにブレークポイントを設定することも、別のライブラリにリンクして関数の動作を変更することもできません。また、ある関数が組み込み関数として認識されると、生成されるコードにその関数の呼び出しがまだ含まれていても、GCC はその関数の情報を使ってその関数の呼び出しに伴う問題について警告したり、より効率的なコードを生成したりすることがあります。たとえば、“printf”が組み込みで、“strlen”がグローバルメモリを変更しないことが分かっていると、-Wformat で“printf”の不正な呼び出しの警告が出ます。

[GCC_ENABLE_BUILTIN_FUNCTIONS, -fno-builtin]";
"[GCC_ENABLE_BUILTIN_FUNCTIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_BUILTIN_FUNCTIONS]-value-[YES]" = "はい";

"[GCC_FORCE_CPU_SUBTYPE_ALL]-name" = "出力ファイルのサブタイプを ALL に設定";
"[GCC_FORCE_CPU_SUBTYPE_ALL]-description" = "このオプションを有効にすると、GCC の出力ファイルで、-mcpu または -march オプションで制御するサブタイプの代わりに、ALL サブタイプが設定されます。  [GCC_FORCE_CPU_SUBTYPE_ALL, -force_cpusubtype_ALL]";
"[GCC_FORCE_CPU_SUBTYPE_ALL]-value-[NO]" = "いいえ";
"[GCC_FORCE_CPU_SUBTYPE_ALL]-value-[YES]" = "はい";

"[GCC_LINK_WITH_DYNAMIC_LIBRARIES]-name" = "共有ライブラリとのリンクを有効にする";
"[GCC_LINK_WITH_DYNAMIC_LIBRARIES]-description" = "共有ライブラリとリンクできるようにします。これがほとんどのプロダクトタイプのデフォルトです。[GCC_LINK_WITH_DYNAMIC_LIBRARIES, -static]";
"[GCC_LINK_WITH_DYNAMIC_LIBRARIES]-value-[NO]" = "いいえ";
"[GCC_LINK_WITH_DYNAMIC_LIBRARIES]-value-[YES]" = "はい";

"[GCC_ENABLE_FLOATING_POINT_LIBRARY_CALLS]-name" = "浮動小数点ライブラリ呼び出しを生成";
"[GCC_ENABLE_FLOATING_POINT_LIBRARY_CALLS]-description" = "浮動小数点のライブラリ呼び出しを含む出力を生成します。[GCC_ENABLE_FLOATING_POINT_LIBRARY_CALLS, -msoft-float]";
"[GCC_ENABLE_FLOATING_POINT_LIBRARY_CALLS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_FLOATING_POINT_LIBRARY_CALLS]-value-[YES]" = "はい";

"[GCC_USE_INDIRECT_FUNCTION_CALLS]-name" = "間接的な関数呼び出しを生成";
"[GCC_USE_INDIRECT_FUNCTION_CALLS]-description" = "デフォルトで、レジスタを使用してすべての関数呼び出しを間接的に行い、現在の場所から 32 メガバイト（33,554,432 バイト）より離れた場所にある関数を呼び出せるようにします。この設定は、“shortcall”関数属性または“#pragma longcall(0)”によって無効にできます。

Mach-O（Darwin）システムでは、-mlongcall はすべての直接呼び出しのグルーを放出するようにコンパイラに指示し、Darwin リンカはそのグルーを使用するか破棄するかを決定します。-mlong-branch は -mlongcall の同意語です。

今後は、リンカがグルーを生成することが分かっているときは、GCC で長い呼び出しの仕様をすべて無視する場合があります。

[GCC_USE_INDIRECT_FUNCTION_CALLS, -mlong-branch]";
"[GCC_USE_INDIRECT_FUNCTION_CALLS]-value-[NO]" = "いいえ";
"[GCC_USE_INDIRECT_FUNCTION_CALLS]-value-[YES]" = "はい";

"[GCC_USE_REGISTER_FUNCTION_CALLS]-name" = "レジスタサブルーチン関数呼び出しを生成";
"[GCC_USE_REGISTER_FUNCTION_CALLS]-description" = "まず関数のアドレスをレジスタに読み込んでからそのレジスタでサブルーチン呼び出しを実行して、関数呼び出しを実行するようにコンパイラに指示します。このスイッチは、ターゲット関数がオフセット・ベース・バージョンのサブルーチン呼び出し命令の 64 メガバイトのアドレス設定範囲の外にある場合に必要です。

このスイッチが有効になっている場合でも、すべての関数呼び出しが long 型の呼び出しになるわけではありません。静的関数、short 型呼び出し属性を持つ関数、#pragma no_long_calls ディレクティブの範囲内にある関数、および定義が現在のコンパイル単位内ですでにコンパイルされている関数は、long 型の呼び出しにならないことが分かります。このルールの例外として、weak 型の関数定義、long 型呼び出し属性またはセクション属性を持つ関数、および #pragma long_calls ディレクティブの範囲内にある関数は、常に long 型の呼び出しになります。

この機能は、デフォルトでは有効になりません。-mno-long-calls を指定すると、関数呼び出しは #pragma long_calls_off ディレクティブの範囲内に配置され、デフォルトの動作が復元されます。これらのスイッチは、コンパイラが関数ポインタを介して関数呼び出しを処理するコードを生成する方法には影響を及ぼしません。

[GCC_USE_REGISTER_FUNCTION_CALLS, -mlong-calls]";
"[GCC_USE_REGISTER_FUNCTION_CALLS]-value-[NO]" = "いいえ";
"[GCC_USE_REGISTER_FUNCTION_CALLS]-value-[YES]" = "はい";

"[GCC_PREFIX_HEADER]-name" = "プレフィックスヘッダ";
"[GCC_PREFIX_HEADER]-description" = "指定されたヘッダを暗黙的にインクルードします。指定するパスは、プロジェクトからの相対パス、または絶対パスでなければなりません。[GCC_PREFIX_HEADER]";
"[GCC_PREFIX_HEADER]-value-[NO]" = "いいえ";
"[GCC_PREFIX_HEADER]-value-[YES]" = "はい";

"[GCC_PRECOMPILE_PREFIX_HEADER]-name" = "プレフィックスヘッダをプリコンパイルする";
"[GCC_PRECOMPILE_PREFIX_HEADER]-description" = "プレフィックスヘッダのプリコンパイル済みヘッダを生成して、全体的なビルド時間を短縮します。 [GCC_PRECOMPILE_PREFIX_HEADER]

メモ：プレフィックスヘッダまたはそこに含まれるファイルの内容がほとんど変化しない場合、プレフィックスヘッダのプリコンパイルは非常に効果的です。プレフィックスヘッダまたはそこに含まれるファイルの内容が頻繁に変化する場合は、全体的なビルド時間にマイナスの影響があることがあります。";
"[GCC_PRECOMPILE_PREFIX_HEADER]-value-[NO]" = "いいえ";
"[GCC_PRECOMPILE_PREFIX_HEADER]-value-[YES]" = "はい";

"[GCC_INCREASE_PRECOMPILED_HEADER_SHARING]-name" = "プリコンパイル済みヘッダの共有を増やす";
"[GCC_INCREASE_PRECOMPILED_HEADER_SHARING]-description" = "このオプションを有効にすると、同じプレフィックスヘッダおよびプリコンパイル済みヘッダのディレクトリを共有するターゲット間でのプリコンパイル済みヘッダの共有の増加が有効になります。

Xcode は、PCH の作成に使用するコンパイラのコマンドラインオプションに基づいてハッシュ値を生成することで、プリコンパイル済みヘッダファイルを区別します。このオプションを有効にすると、特定のコンパイラオプションがそのハッシュから除外されます。現在のところ、このオプションでは、検索パスオプション（-I、-iquote、-isystem、-F、-L）はハッシュから除外されます。

PCH ファイルの共有の増加を有効にすることにはいくらかのリスクが伴います。2 つのターゲットが同じプレフィックスヘッダを使用していても、インクルードパスが異なるためにプリコンパイル時に異なるファイルがプレフィックスヘッダに含まれる場合、一方のターゲットがもう一方のターゲットに含まれるファイルを使用してビルドされた PCH を使用するために、微妙な問題が起きることがあります。その場合は、問題を修正するために、このオプションをオフにする必要があります。

[GCC_INCREASE_PRECOMPILED_HEADER_SHARING]";
"[GCC_INCREASE_PRECOMPILED_HEADER_SHARING]-value-[NO]" = "いいえ";
"[GCC_INCREASE_PRECOMPILED_HEADER_SHARING]-value-[YES]" = "はい";

"[OTHER_CFLAGS]-name" = "その他の C フラグ";
"[OTHER_CFLAGS]-description" = "C および Objective-C ファイルのコンパイラに渡す追加フラグの、スペース区切りのリストです。空白または特殊文字を含む引数（空白を含むパス名など）には、バックスラッシュでエスケープしてください。この設定は、Xcode が C または Objective-C コンパイラの特定のフラグの UI をまだ提供していない場合に使用します。[OTHER_CFLAGS]";

"[OTHER_CPLUSPLUSFLAGS]-name" = "その他の C++ フラグ";
"[OTHER_CPLUSPLUSFLAGS]-description" = "C++ および Objective-C++ ファイルのコンパイラに渡す追加フラグの、スペース区切りのリストです。空白または特殊文字を含む引数（空白を含むパス名など）には、バックスラッシュでエスケープしてください。この設定は、Xcode が C++ または Objective-C++ コンパイラのフラグの UI をまだ提供していない場合に使用します。[OTHER_CPLUSPLUSFLAGS]";


"[Warnings]-category" = "警告";

"[GCC_TREAT_WARNINGS_AS_ERRORS]-name" = "警告をエラーと見なす";
"[GCC_TREAT_WARNINGS_AS_ERRORS]-description" = "このオプションを有効にすると、すべての警告はエラーと見なされます。[GCC_TREAT_WARNINGS_AS_ERRORS, -Werror]";
"[GCC_TREAT_WARNINGS_AS_ERRORS]-value-[NO]" = "いいえ";
"[GCC_TREAT_WARNINGS_AS_ERRORS]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_MISSING_FIELD_INITIALIZERS]-name" = "構造体初期化子にフィールドがありません";
"[GCC_WARN_ABOUT_MISSING_FIELD_INITIALIZERS]-description" = "構造体の初期化子で一部のフィールドが見つからない場合に警告します。たとえば、\"x.h\" は暗黙的にゼロなので、次のコードはそのような警告の原因になります：

    struct s { int f, g, h; };
    struct s x = { 3, 4 };

このオプションでは、指定された初期化子については警告されないので、次の変更では警告は行われません：

    struct s { int f, g, h; };
    struct s x = { .f = 3, .g = 4 };

[GCC_WARN_ABOUT_MISSING_FIELD_INITIALIZERS, -Wmissing-field-initializers]";
"[GCC_WARN_ABOUT_MISSING_FIELD_INITIALIZERS]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_MISSING_FIELD_INITIALIZERS]-value-[YES]" = "はい";

"[GCC_TREAT_NONCONFORMANT_CODE_ERRORS_AS_WARNINGS]-name" = "標準に準拠していないコードのエラーを警告として扱う";
"[GCC_TREAT_NONCONFORMANT_CODE_ERRORS_AS_WARNINGS]-description" = "このオプションを有効にすると、標準に準拠していないコードについて出力されるメッセージが、エラーから警告に降格されます。デフォルトの G++ では、-pedantic ではなく -pedantic-errors が設定されます。このオプションを指定した場合は、-pedantic が指定されます。この動作およびこのオプションは -pedantic に置き換わり、GNU C の場合と同様に機能します。[GCC_TREAT_NONCONFORMANT_CODE_ERRORS_AS_WARNINGS, -fpermissive]";
"[GCC_TREAT_NONCONFORMANT_CODE_ERRORS_AS_WARNINGS]-value-[NO]" = "いいえ";
"[GCC_TREAT_NONCONFORMANT_CODE_ERRORS_AS_WARNINGS]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_MISSING_PROTOTYPES]-name" = "関数プロトタイプの不在";
"[GCC_WARN_ABOUT_MISSING_PROTOTYPES]-description" = "プロトタイプが見つからないという警告を発行します。[GCC_WARN_ABOUT_MISSING_PROTOTYPES, -Wmissing-prototypes]";
"[GCC_WARN_ABOUT_MISSING_PROTOTYPES]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_MISSING_PROTOTYPES]-value-[YES]" = "はい";

"[GCC_TREAT_IMPLICIT_FUNCTION_DECLARATIONS_AS_ERRORS]-name" = "関数プロトタイプの不在をエラーとして取り扱う";
"[GCC_TREAT_IMPLICIT_FUNCTION_DECLARATIONS_AS_ERRORS]-description" = "関数プロトタイプの不在をエラーとして取り扱う警告を発生します。C および Objective-C にのみ適用されます。[GCC_TREAT_IMPLICIT_FUNCTION_DECLARATIONS_AS_ERRORS, -Werror-implicit-function-declaration]";
"[GCC_TREAT_IMPLICIT_FUNCTION_DECLARATIONS_AS_ERRORS]-value-[NO]" = "いいえ";
"[GCC_TREAT_IMPLICIT_FUNCTION_DECLARATIONS_AS_ERRORS]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_RETURN_TYPE]-name" = "戻り値のデータ型が一致しない";
"[GCC_WARN_ABOUT_RETURN_TYPE]-description" = "戻り値のデータ型（void 以外）が定義されている関数に戻り値のない return 文が含まれるときに、警告を発行します。戻り値のデータ型を指定しないで関数を定義したときにも、警告を発行します。[GCC_WARN_ABOUT_RETURN_TYPE, -Wreturn-type]";
"[GCC_WARN_ABOUT_RETURN_TYPE]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_RETURN_TYPE]-value-[YES]" = "はい";

"[GCC_WARN_NON_VIRTUAL_DESTRUCTOR]-name" = "非仮想デストラクタ";
"[GCC_WARN_NON_VIRTUAL_DESTRUCTOR]-description" = "クラスが多形的に使用されるように見えるため、通常仮想であるべきデストラクタをクラスで非仮想デストラクタと宣言している場合に警告します。[GCC_WARN_NON_VIRTUAL_DESTRUCTOR, -Wnon-virtual-dtor]

これは C++ または Objective-C++ のソースのみで有効です。";
"[GCC_WARN_NON_VIRTUAL_DESTRUCTOR]-value-[NO]" = "いいえ";
"[GCC_WARN_NON_VIRTUAL_DESTRUCTOR]-value-[YES]" = "はい";

"[GCC_WARN_EFFECTIVE_CPLUSPLUS_VIOLATIONS]-name" = "Effective C++ 違反";
"[GCC_WARN_EFFECTIVE_CPLUSPLUS_VIOLATIONS]-description" = "Scott Meyers 著“Effective C++”の以下のスタイルガイドラインに対する違反について警告します：
	項目 11：メモリが動的に割り当てられるクラスには、コピーコンストラクタと割り当て演算子を定義する。
	項目 12：コンストラクタでは割り当てではなく初期化を行う。
	項目 14：基底クラスのデストラクタを仮想にする。
	項目 15：operator= で *this ヘの参照を返すようにする。
	項目 23：オブジェクトを返す必要がある場合に参照を返そうとしない。

	さらに、Scott Meyers 著“More Effective C++”の以下のスタイルガイドラインに対する違反について警告します：
	項目 6：インクリメント演算子、デクリメント演算子の前置と後置を区別する。
	項目 7：&&、||、, をオーバーロードしない。

このオプションを使用する場合、標準ライブラリヘッダ自体がこのガイドラインに完全には従っていないことに注意してください。それらの警告は grep -v で取り除くことができます。[GCC_WARN_EFFECTIVE_CPLUSPLUS_VIOLATIONS, -Weffc++]";
"[GCC_WARN_EFFECTIVE_CPLUSPLUS_VIOLATIONS]-value-[NO]" = "いいえ";
"[GCC_WARN_EFFECTIVE_CPLUSPLUS_VIOLATIONS]-value-[YES]" = "はい";

"[GCC_WARN_HIDDEN_VIRTUAL_FUNCTIONS]-name" = "オーバーロードされた仮想関数";
"[GCC_WARN_HIDDEN_VIRTUAL_FUNCTIONS]-description" = "関数宣言によって基底クラスから派生した仮想関数が隠される場合に警告します。[GCC_WARN_HIDDEN_VIRTUAL_FUNCTIONS, -Woverloaded-virtual]

たとえば、次のようなコードで：

	struct A {
	  virtual void f();
	};

	struct B: public A {
	  void f(int);
	};

A クラスバージョンの f() が B に隠されるため、次のようなコードを記述すると：

	B* b;
	b->f();

コンパイルに失敗します。この設定は C++ と Objective-C++ のソースのみに適用されます。";
"[GCC_WARN_HIDDEN_VIRTUAL_FUNCTIONS]-value-[NO]" = "いいえ";
"[GCC_WARN_HIDDEN_VIRTUAL_FUNCTIONS]-value-[YES]" = "はい";

"[GCC_WARN_TYPECHECK_CALLS_TO_PRINTF]-name" = "printf/scanf の呼び出しのタイプチェック";
"[GCC_WARN_TYPECHECK_CALLS_TO_PRINTF]-description" = "printf、scanf などを呼び出して、渡された引数の型が指定されたフォーマット文字列に適していること、およびその文字列に指定されている変換が適切であることを確認します。[GCC_WARN_TYPECHECK_CALLS_TO_PRINTF, -Wno-format]";
"[GCC_WARN_TYPECHECK_CALLS_TO_PRINTF]-value-[NO]" = "いいえ";
"[GCC_WARN_TYPECHECK_CALLS_TO_PRINTF]-value-[YES]" = "はい";

"[GCC_WARN_INITIALIZER_NOT_FULLY_BRACKETED]-name" = "初期化子がかっこで完全に囲まれていない";
"[GCC_WARN_INITIALIZER_NOT_FULLY_BRACKETED]-description" = "集成体または共用体の初期化子が完全に中カッコでくくられていない場合に警告します。

	たとえば、次の“a”の初期化子は完全に中カッコでくくられていませんが、“b”の初期化子は完全に中カッコでくくられています。

	int a[2][2] = { 0, 1, 2, 3 };
	int b[2][2] = { { 0, 1 }, { 2, 3 } };

[GCC_WARN_INITIALIZER_NOT_FULLY_BRACKETED, -Wmissing-braces]";
"[GCC_WARN_INITIALIZER_NOT_FULLY_BRACKETED]-value-[NO]" = "いいえ";
"[GCC_WARN_INITIALIZER_NOT_FULLY_BRACKETED]-value-[YES]" = "はい";

"[GCC_WARN_MISSING_PARENTHESES]-name" = "大かっこ、丸かっこの不在";
"[GCC_WARN_MISSING_PARENTHESES]-description" = "正しい値が期待されるコンテキストで割り当てがあるときや、優先順位でしばしば混乱が見られる演算子がネストされているときなどに、特定のコンテキストで丸カッコが省略されている場合に、警告します。

また、if 文と else 分岐が属する構築部分で混乱が起きる可能性のあるときも警告します。そのような場合の例を次に示します：
{
  if (a)
    if (b)
      foo ();
  else
    bar ();
}

	C では、すべての else 分岐はできるだけ内側の if 文に属します。この例では if (b) です。上の例でプログラマが選択したインデント設定に例示されているように、これはしばしばプログラマが予期することとは異なります。このような混乱の可能性がある場合、GCC はこのフラグが指定されたときに警告を発行します。警告を排除するには、最も内側の if 文の周りに明示的な中カッコを追加して、内包している if に else が属することがないようにします。コードは次のようになります：
{
  if (a)
    {
      if (b)
        foo ();
      else
        bar ();
    }
}

[GCC_WARN_MISSING_PARENTHESES, -Wparentheses]";
"[GCC_WARN_MISSING_PARENTHESES]-value-[NO]" = "いいえ";
"[GCC_WARN_MISSING_PARENTHESES]-value-[YES]" = "はい";

"[GCC_WARN_CHECK_SWITCH_STATEMENTS]-name" = "switch ステートメントのチェック";
"[GCC_WARN_CHECK_SWITCH_STATEMENTS]-description" = "switch ステートメントに列挙型の索引があるときに、その列挙に指定されているコードの一部の case が欠落しているときに、警告を発行します。デフォルトラベルがあれば、この警告は発行されません。このオプションを使用するときには、列挙の範囲を超えて case ラベルが指定されている場合にも、警告が発行されます。[GCC_WARN_CHECK_SWITCH_STATEMENTS, -Wswitch]";
"[GCC_WARN_CHECK_SWITCH_STATEMENTS]-value-[NO]" = "いいえ";
"[GCC_WARN_CHECK_SWITCH_STATEMENTS]-value-[YES]" = "はい";

"[GCC_WARN_UNUSED_FUNCTION]-name" = "未使用の関数";
"[GCC_WARN_UNUSED_FUNCTION]-description" = "ある静的関数が宣言されているのに、そのインライン化されていない静的関数が使用されていない場合に警告します。[GCC_WARN_UNUSED_FUNCTION, -Wunused-function]";
"[GCC_WARN_UNUSED_FUNCTION]-value-[NO]" = "いいえ";
"[GCC_WARN_UNUSED_FUNCTION]-value-[YES]" = "はい";

"[GCC_WARN_UNUSED_LABEL]-name" = "未使用のラベル";
"[GCC_WARN_UNUSED_LABEL]-description" = "あるラベルが宣言されているのに使用されていない場合に警告します。[GCC_WARN_UNUSED_LABEL, -Wunused-label]";
"[GCC_WARN_UNUSED_LABEL]-value-[NO]" = "いいえ";
"[GCC_WARN_UNUSED_LABEL]-value-[YES]" = "はい";

"[GCC_WARN_UNINITIALIZED_AUTOS]-name" = "初期化されていない自動変数";
"[GCC_WARN_UNINITIALIZED_AUTOS]-description" = "変数が setjmp 呼び出しによって重大な影響を受けた場合、または自動変数が事前の初期化なしで使用された場合に警告します。

    初期化されていない自動変数の検出には、最適化されたコンパイル時にのみ有効になるデータフロー分析が必要です。

    GCC は、自動変数が初期化されているすべての事例、または初期化前の使用につながる可能性のあるすべての使用パターンを検出することはできません。 [GCC_WARN_UNINITIALIZED_AUTOS, -Wuninitialized]";
"[GCC_WARN_UNINITIALIZED_AUTOS]-value-[NO]" = "いいえ";
"[GCC_WARN_UNINITIALIZED_AUTOS]-value-[YES]" = "はい";

"[GCC_WARN_UNKNOWN_PRAGMAS]-name" = "未知の Pragma";
"[GCC_WARN_UNKNOWN_PRAGMAS]-description" = "GCC が理解できない #pragma ディレクティブが見つかった場合に警告します。このコマンドラインオプションを使用した場合には、システムヘッダファイルに不明な pragma があった場合にも警告します。-Wall コマンドラインオプションを使用して、この警告が有効になっている場合には適用されません。[GCC_WARN_UNKNOWN_PRAGMAS, -Wunknown-pragmas]";
"[GCC_WARN_UNKNOWN_PRAGMAS]-value-[NO]" = "いいえ";
"[GCC_WARN_UNKNOWN_PRAGMAS]-value-[YES]" = "はい";

"[GCC_WARN_INHIBIT_ALL_WARNINGS]-name" = "すべての警告を抑制";
"[GCC_WARN_INHIBIT_ALL_WARNINGS]-description" = "すべての警告メッセージを抑制します。[-GCC_WARN_INHIBIT_ALL_WARNINGS, -w]";
"[GCC_WARN_INHIBIT_ALL_WARNINGS]-value-[NO]" = "いいえ";
"[GCC_WARN_INHIBIT_ALL_WARNINGS]-value-[YES]" = "はい";

"[GCC_WARN_PEDANTIC]-name" = "厳密な警告";
"[GCC_WARN_PEDANTIC]-description" = "厳密な ISO C および ISO C++ が要求するすべての警告を発行します。禁止されている機能拡張を使用するすべてのプログラム、ISO C および ISO C++ に準拠していない一部のプログラムを拒否します。ISO C の場合は、-std オプションが指定されている ISO C 標準に準拠します。[GCC_WARN_PEDANTIC, -pedantic]";
"[GCC_WARN_PEDANTIC]-value-[NO]" = "いいえ";
"[GCC_WARN_PEDANTIC]-value-[YES]" = "はい";

"[GCC_WARN_SHADOW]-name" = "ローカル変数の隠蔽";
"[GCC_WARN_SHADOW]-description" = "あるローカル変数が別のローカル変数、パラメータ、またはグローバル変数を隠している場合、あるいは組み込み関数が隠されている場合に警告します。[GCC_WARN_SHADOW, -Wshadow]";
"[GCC_WARN_SHADOW]-value-[NO]" = "いいえ";
"[GCC_WARN_SHADOW]-value-[YES]" = "はい";

"[GCC_WARN_FOUR_CHARACTER_CONSTANTS]-name" = "4 文字リテラル";
"[GCC_WARN_FOUR_CHARACTER_CONSTANTS]-description" = "4 文字リテラル（MacOS 形式の OSTypes: 'APPL' など）について警告します。[GCC_WARN_FOUR_CHARACTER_CONSTANTS, -Wfour-char-constants]";
"[GCC_WARN_FOUR_CHARACTER_CONSTANTS]-value-[NO]" = "いいえ";
"[GCC_WARN_FOUR_CHARACTER_CONSTANTS]-value-[YES]" = "はい";

"[GCC_WARN_SIGN_COMPARE]-name" = "符号の比較";
"[GCC_WARN_SIGN_COMPARE]-description" = "符号付きの値を符号なしの値に変換したときに、符号付きの値の結果と符号なしの値の結果が違う場合に警告します。この警告は、-W（C++ では -Wall）を指定したときにだけ有効になります。[GCC_WARN_SIGN_COMPARE, -Wsign-compare]";
"[GCC_WARN_SIGN_COMPARE]-value-[NO]" = "いいえ";
"[GCC_WARN_SIGN_COMPARE]-value-[YES]" = "はい";

"[GCC_WARN_PROTOTYPE_CONVERSION]-name" = "プロトタイプの変換";
"[GCC_WARN_PROTOTYPE_CONVERSION]-description" = "プロトタイプがないときに同じ引数に対して行われる変換とは異なる型変換がプロトタイプによって行われる場合に警告します。これには、デフォルトの昇格と同じ場合を除いて、固定小数点から浮動小数点への変換とその逆の変換、および固定小数点引数の幅または符号の有無を変更する変換が含まれます。

また、負の整数の定数式が暗黙的に符号のない型に変換される場合にも警告します。たとえば、\"x\" に符号がない場合は、\"x = -1\" の割り当てについて警告します。ただし、\"(unsigned) -1\" のような明示的なキャストについては警告しません。  [GCC_WARN_PROTOTYPE_CONVERSION, -Wconversion]";
"[GCC_WARN_PROTOTYPE_CONVERSION]-value-[NO]" = "いいえ";
"[GCC_WARN_PROTOTYPE_CONVERSION]-value-[YES]" = "はい";

"[GCC_WARN_MULTIPLE_DEFINITION_TYPES_FOR_SELECTOR]-name" = "セレクタに複数の定義のタイプがあります";
"[GCC_WARN_MULTIPLE_DEFINITION_TYPES_FOR_SELECTOR]-description" = "コンパイル中に同じセレクタに対して異なるタイプの複数のメソッドが見つかった場合に、警告します。チェックは、コンパイルの最後の段階でメソッドのリストに対して実行されます。また、\"@selector(...)\"  式に出てくる各セレクタに対してチェックが実行され、そのセレクタに対応するメソッドがコンパイル中に見つかりました。これらのチェックでは、コンパイルの最後でのみメソッドテーブルをスキャンするため、たとえば、コンパイル中にエラーが見つかったため、または -fsyntax-only オプションが使用されているために、コンパイルの最後の段階まで達しない場合は、これらの警告は生成されません。 [GCC_WARN_MULTIPLE_DEFINITION_TYPES_FOR_SELECTOR, -Wselector]";

"[GCC_WARN_STRICT_SELECTOR_MATCH]-name" = "厳格なセレクタ一致";
"[GCC_WARN_STRICT_SELECTOR_MATCH]-description" = "指定されたセレクタを使用してタイプ \"id\" または \"Class\" のレシーバにメッセージを送信しようとするときに、そのセレクタに異なる引数または戻り値型を持つ複数のメソッドが見つかった場合に、警告します。この設定を無効にすると、見つかった相違が同じサイズと配置を共有するタイプに限定される場合は、コンパイラはそのような警告を省略します。  [GCC_WARN_STRICT_SELECTOR_MATCH, -Wstrict-selector-match]";

"[GCC_WARN_UNDECLARED_SELECTOR]-name" = "セレクタが宣言されていません";
"[GCC_WARN_UNDECLARED_SELECTOR]-description" = "宣言されていないセレクタに関する \"@selector(...)\" 式が見つかった場合に警告します。その名前を持つメソッドが \"@selector(...)\" 式の前で、@interface または @protocol 宣言で明示的に、または @implementation セクションで暗黙的に宣言されていない場合、セレクタは宣言されていないと見なされます。このオプションでは常に、\"@selector(...)\" 式が見つかるとすぐにチェックが実行されますが、-Wselector ではコンパイルの最後の段階でのみチェックが実行されます。これにより、メソッドとセレクタは使用する前に宣言する必要があるというコーディングスタイルの規則も適用されます。 [GCC_WARN_UNDECLARED_SELECTOR, -Wundeclared-selector]";

"[GCC_WARN_ABOUT_GLOBAL_CONSTRUCTORS]-name" = "グローバルな構築または破棄が必要";
"[GCC_WARN_ABOUT_GLOBAL_CONSTRUCTORS]-description" = "構築と破棄が必要な名前空間スコープデータ、またはコンストラクタ属性やデストラクタ属性を使用する関数について警告します。また、Objective-C GNU ランタイムを使用して各種のメタデータが初期化される場合にも警告します。[GCC_WARN_ABOUT_GLOBAL_CONSTRUCTORS, -Wglobal-constructors]";
"[GCC_WARN_ABOUT_GLOBAL_CONSTRUCTORS]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_GLOBAL_CONSTRUCTORS]-value-[YES]" = "はい";

"[WARNING_CFLAGS]-name" = "その他の警告フラグ";
"[WARNING_CFLAGS]-description" = "コンパイラに渡す追加警告フラグの、スペース区切りのリストです。この設定は、Xcode がコンパイラの特定の警告フラグの UI をまだ提供していない場合に使用します。[WARNING_CFLAGS]";


"[CodeGeneration]-category" = "コード生成";

"[GCC_GENERATE_DEBUGGING_SYMBOLS]-name" = "デバッグシンボルの生成";
"[GCC_GENERATE_DEBUGGING_SYMBOLS]-description" = "デバッグシンボルの生成を有効または無効にします。デバッグシンボルを有効にした場合、その詳細レベルはビルドの“デバッグシンボルのレベル”の設定を使って制御できます。[GCC_GENERATE_DEBUGGING_SYMBOLS]";
"[GCC_GENERATE_DEBUGGING_SYMBOLS]-value-[NO]" = "いいえ";
"[GCC_GENERATE_DEBUGGING_SYMBOLS]-value-[YES]" = "はい";

"[GCC_OPTIMIZATION_LEVEL]-name" = "最適化レベル";
"[GCC_OPTIMIZATION_LEVEL]-description" = "なし：最適化しません。 [-O0]

この設定では、コンパイラの目標はコンパイルのコストを削減し、デバッグで所期の結果を出すことです。各文は独立しています。文と文の間のブレークポイントでプログラムを停止する場合は、新しい値を変数に割り当てたり、プログラムカウンタを関数内のほかの文に変更して、厳密にソースコードから予期される結果を得たりすることができます。

高速：コンパイルの最適化にいくらか時間がかかり、大規模な関数の場合は大量のメモリが必要です。 [-O, -O1]

この設定では、コンパイラはコードサイズと実行時間を削減しようとします。長いコンパイル時間がかかる最適化は実行しません。アップルのコンパイラでは、最適化時の厳密なエイリアス処理、ブロックの並べ替え、およびブロック間のスケジューリングはデフォルトで無効になります。

より高速：コンパイラは、領域と速度のトレードオフが関係しない、サポートされているほとんどすべての最適化を実行します。 [-O2]

この設定では、コンパイラは、ループのアンロールや関数のインライン化、またはレジスタの名前変更を実行しません。“高速”設定と比較すると、この設定では、コンパイル時間が増加するとともに生成コードのパフォーマンスも向上します。

最も高速：“より高速”設定で指定したすべての最適化をオンにし、関数のインライン化とレジスタの名前変更のオプションもオンにします。この設定では、バイナリが大きくなることがあります。 [-O3]

最も高速で最小：サイズを最適化します。この設定では、通常はコードサイズが増加しない“より高速”の最適化がすべて有効になります。また、コードサイズを削減するように設計されたほかの最適化も実行します。 [-Os]

[GCC_OPTIMIZATION_LEVEL]";
"[GCC_OPTIMIZATION_LEVEL]-value-[0]" = "なし [-O0]";
"[GCC_OPTIMIZATION_LEVEL]-value-[1]" = "高速 [-O, O1]";
"[GCC_OPTIMIZATION_LEVEL]-value-[2]" = "より高速 [-O2]";
"[GCC_OPTIMIZATION_LEVEL]-value-[3]" = "最も高速 [-O3]";
"[GCC_OPTIMIZATION_LEVEL]-value-[s]" = "最も高速で最小 [-Os]";

"[GCC_NO_COMMON_BLOCKS]-name" = "非共通ブロック";
"[GCC_NO_COMMON_BLOCKS]-description" = "C では、初期化されていないグローバル変数を、共通ブロックとして生成しないで、オブジェクトファイルのデータセクションに割り当てます。同じ変数が（extern を使用しないで）2 つの異なるコンパイルで宣言されている場合、それらのコンパイルをリンクしたときに、エラーが発生することがあります。この機能は、常に extern を使用しないで動作するシステムでこのプログラムが動作するかどうかを確認したい場合に利用します。[GCC_NO_COMMON_BLOCKS, -fno-common]";
"[GCC_NO_COMMON_BLOCKS]-value-[NO]" = "いいえ";
"[GCC_NO_COMMON_BLOCKS]-value-[YES]" = "はい";

"[GCC_REUSE_STRINGS]-name" = "文字列を読み込み専用にする";
"[GCC_REUSE_STRINGS]-description" = "文字列リテラルを再利用します。[GCC_REUSE_STRINGS, -fwritable-strings]";
"[GCC_REUSE_STRINGS]-value-[NO]" = "いいえ";
"[GCC_REUSE_STRINGS]-value-[YES]" = "はい";

"[GCC_DYNAMIC_NO_PIC]-name" = "位置依存コードを生成";
"[GCC_DYNAMIC_NO_PIC]-description" = "アプリケーションからの関数呼び出しを高速化します。共有ライブラリには適していません（位置独立でなければなりません）。[GCC_DYNAMIC_NO_PIC, -mdynamic-no-pic]";
"[GCC_DYNAMIC_NO_PIC]-value-[NO]" = "いいえ";
"[GCC_DYNAMIC_NO_PIC]-value-[YES]" = "はい";

"[GCC_WARN_UNUSED_PARAMETER]-name" = "未使用パラメータの警告";
"[GCC_WARN_UNUSED_PARAMETER]-description" = "ある関数パラメータが宣言されているのに使用されていない場合に警告します。[GCC_WARN_UNUSED_PARAMETER, -Wunused-parameter]";
"[GCC_WARN_UNUSED_PARAMETER]-value-[NO]" = "いいえ";
"[GCC_WARN_UNUSED_PARAMETER]-value-[YES]" = "はい";

"[GCC_WARN_UNUSED_VARIABLE]-name" = "未使用の変数";
"[GCC_WARN_UNUSED_VARIABLE]-description" = "ローカル変数または定数でない静的変数が宣言されているのに使用されていない場合に警告します。[GCC_WARN_UNUSED_VARIABLE, -Wunused-variable]";
"[GCC_WARN_UNUSED_VARIABLE]-value-[NO]" = "いいえ";
"[GCC_WARN_UNUSED_VARIABLE]-value-[YES]" = "はい";

"[GCC_WARN_UNUSED_VALUE]-name" = "未使用の値";
"[GCC_WARN_UNUSED_VALUE]-description" = "明示的に使用されていない結果をステートメントが計算する場合に警告します。[GCC_WARN_UNUSED_VALUE, -Wunused-value]";
"[GCC_WARN_UNUSED_VALUE]-value-[NO]" = "いいえ";
"[GCC_WARN_UNUSED_VALUE]-value-[YES]" = "はい";

"[GCC_CW_ASM_SYNTAX]-name" = "CodeWarrior 構文のインライン・アセンブラ";
"[GCC_CW_ASM_SYNTAX]-description" = "GCC 標準構文以外に、インライン・アセンブリ・コード用の CodeWarrior 構文を有効にします。[GCC_CW_ASM_SYNTAX, -fasm-blocks]";
"[GCC_CW_ASM_SYNTAX]-value-[NO]" = "いいえ";
"[GCC_CW_ASM_SYNTAX]-value-[YES]" = "はい";

"[GCC_UNROLL_LOOPS]-name" = "ループをアンロールする";
"[GCC_UNROLL_LOOPS]-description" = "ループをアンロールします。アンロールするとコードが大きくなりますが、実行する分岐の数が減るので、コードが高速化されます。[GCC_UNROLL_LOOPS, -funroll-loops]";
"[GCC_UNROLL_LOOPS]-value-[NO]" = "いいえ";
"[GCC_UNROLL_LOOPS]-value-[YES]" = "はい";

"[GCC_FAST_MATH]-name" = "IEEE 互換を緩める";
"[GCC_FAST_MATH]-description" = "IEEE754 互換ではないが通常は機能する浮動小数点最適化の一部を有効にします。このオプションは、厳密な IEEE 互換を要求するプログラムでは使用できないことがあります。[GCC_FAST_MATH, -ffast-math]";
"[GCC_FAST_MATH]-value-[NO]" = "いいえ";
"[GCC_FAST_MATH]-value-[YES]" = "はい";

"[GCC_STRICT_ALIASING]-name" = "厳格なエイリアスを適用する";
"[GCC_STRICT_ALIASING]-description" = "あるポインタがほかのポインタと同じオブジェクトを指せるかどうかについてより厳格に仮定する方法で、コードを最適化します。多くのポインタを使用するプログラムの場合は、このオプションを利用すると効果があります。ただし、オブジェクトにアクセスするときのデータ型について、ISO C ルールに厳格に準拠していないプログラムの場合は、予期しない動作が起きることがあります。[GCC_STRICT_ALIASING, -fstrict-aliasing]";
"[GCC_STRICT_ALIASING]-value-[NO]" = "いいえ";
"[GCC_STRICT_ALIASING]-value-[YES]" = "はい";

"[GCC_MODEL_CPU]-name" = "ターゲット CPU";
"[GCC_MODEL_CPU]-description" = "生成されるコードに使用するインストラクションとレジスタのセットです。コードは、古いプロセッサでは動作しません。[GCC_MODEL_CPU, -mcpu=<cpu>]";
"[GCC_MODEL_CPU]-value-[]" = "PowerPC 一般";
"[GCC_MODEL_CPU]-value-[G3]" = "PowerPC G3 [-mcpu=G3]";
"[GCC_MODEL_CPU]-value-[G4]" = "PowerPC G4 [-mcpu=G4]";
"[GCC_MODEL_CPU]-value-[G5]" = "PowerPC G5 [-mcpu=G5]";

"[GCC_MODEL_TUNING]-name" = "インストラクションスケジュール";
"[GCC_MODEL_TUNING]-description" = "この CPU のインストラクションスケジュールを最適化します。生成されたコードは古いプロセッサで動作します。[GCC_MODEL_TUNING, -mtune=<cpu>]";
"[GCC_MODEL_TUNING]-value-[]" = "なし";
"[GCC_MODEL_TUNING]-value-[G3]" = "PowerPC G3 [-mtune=G3]";
"[GCC_MODEL_TUNING]-value-[G4]" = "PowerPC G4 [-mtune=G4]";
"[GCC_MODEL_TUNING]-value-[G5]" = "PowerPC G5 [-mtune=G5]";

"[GCC_MODEL_PPC64]-name" = "64 ビット整数演算を使用する";
"[GCC_MODEL_PPC64]-description" = "64 ビットのレジスタと算術論理演算の操作コードを使用する整数インストラクションを発行します。この設定を使用してコンパイルしたコードは、32 ビットのプロセッサでは動作しません。[GCC_MODEL_PPC64, -mpowerpc64]";
"[GCC_MODEL_PPC64]-value-[NO]" = "いいえ";
"[GCC_MODEL_PPC64]-value-[YES]" = "はい";

"[GCC_INSTRUMENT_PROGRAM_FLOW_ARCS]-name" = "プログラムフローを計測";
"[GCC_INSTRUMENT_PROGRAM_FLOW_ARCS]-description" = "この設定を有効にすると、プログラムフローの分岐を計測するためのコードが追加されます。詳しくは、gcc のマニュアルページ（man で表示）を参照してください。[GCC_INSTRUMENT_PROGRAM_FLOW_ARCS, -fprofile-arcs]";
"[GCC_INSTRUMENT_PROGRAM_FLOW_ARCS]-value-[NO]" = "いいえ";
"[GCC_INSTRUMENT_PROGRAM_FLOW_ARCS]-value-[YES]" = "はい";

"[GCC_GENERATE_TEST_COVERAGE_FILES]-name" = "テスト・カバレッジ・ファイルを生成";
"[GCC_GENERATE_TEST_COVERAGE_FILES]-description" = "この設定を有効にすると、gcov コードカバレッジユーティリティがプログラムカバレッジを表示するために使用するログファイルが生成されます。詳しくは、gcc のマニュアルページ（man で表示）を参照してください。[GCC_GENERATE_TEST_COVERAGE_FILES, -ftest-coverage]";
"[GCC_GENERATE_TEST_COVERAGE_FILES]-value-[NO]" = "いいえ";
"[GCC_GENERATE_TEST_COVERAGE_FILES]-value-[YES]" = "はい";

"[GCC_WARN_ALLOW_INCOMPLETE_PROTOCOL]-name" = "Objective-C 未実装のプロトコル";
"[GCC_WARN_ALLOW_INCOMPLETE_PROTOCOL]-description" = "あるプロトコルが必要とするメソッドがそのプロトコルを使用するクラスに実装されていない場合には、警告します。これは Objective-C と Objective-C++ のみに適用されます。[GCC_WARN_ALLOW_INCOMPLETE_PROTOCOL, -Wno-protocol]";
"[GCC_WARN_ALLOW_INCOMPLETE_PROTOCOL]-value-[NO]" = "いいえ";
"[GCC_WARN_ALLOW_INCOMPLETE_PROTOCOL]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_DEPRECATED_FUNCTIONS]-name" = "推奨されない関数についての警告";
"[GCC_WARN_ABOUT_DEPRECATED_FUNCTIONS]-description" = "推奨されない関数、変数、およびデータ型（‘deprecated’属性のあるもの）が使用されていることを警告します。[GCC_WARN_ABOUT_DEPRECATED_FUNCTIONS, -Wno-deprecated-declarations]";
"[GCC_WARN_ABOUT_DEPRECATED_FUNCTIONS]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_DEPRECATED_FUNCTIONS]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_INVALID_OFFSETOF_MACRO]-name" = "offsetof マクロの未定義の使用についての警告";
"[GCC_WARN_ABOUT_INVALID_OFFSETOF_MACRO]-description" = "この設定のチェックを外すと、offsetof マクロを非 POD 型に適用した場合の警告が抑制されます。1998 ISO C++ 規格によると、offsetof の非 POD 型への適用は未定義です。ただし、現行の C++ 実装では、offsetof を一定の種類の非 POD 型（コンストラクタを持つという理由だけで POD 型として扱われない単純な構造体など）に適用した場合、通常は意味のある結果になります。このフラグは、移植性のないコードを意識的に記述していて、この警告を熟慮の上で無視することにしたユーザだけが使用してください。

将来のバージョンの C++ 規格では、offsetof に関する制限が緩和される可能性があります。[GCC_WARN_ABOUT_INVALID_OFFSETOF_MACRO, -Wno-invalid-offsetof]";
"[GCC_WARN_ABOUT_INVALID_OFFSETOF_MACRO]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_INVALID_OFFSETOF_MACRO]-value-[YES]" = "はい";

"[GCC_FAST_OBJC_DISPATCH]-name" = "アクセラレートされた Objective-C ディスパッチ";
"[GCC_FAST_OBJC_DISPATCH]-description" = "高度にアクセラレートされたディスパッチを Objective-C ランタイムに対して有効にします。これは Objective-C と Objective-C++ のみに適用されます。[GCC_FAST_OBJC_DISPATCH, -fobjc-direct-dispatch]";
"[GCC_FAST_OBJC_DISPATCH]-value-[NO]" = "いいえ";
"[GCC_FAST_OBJC_DISPATCH]-value-[YES]" = "はい";

"[GCC_ENABLE_OBJC_GC]-name" = "Objective-C ガベージコレクション";
"[GCC_ENABLE_OBJC_GC]-description" = "Objective-C ランタイム内でガベージコレクタの書き込み禁止割り当てプリミティブを使用するようにコードをコンパイルします。コードには、GC 対応であることを示すマークが付きます。GC 対応のマークが付いたアプリケーションは、ランタイムからガベージコレクションを有効にして起動されます。このアプリケーションでリンクまたは読み込まれるすべての Objective-C コードも GC 対応でなければなりません。GC“必須”としてコンパイルされたコードは、従来の Cocoa retain/release メソッドを使用しないものと見なされるため、ガベージコレクションを有効にして実行していないアプリケーションには読み込めません。GC“サポートあり”としてコンパイルされたコードは、従来の retain/release メソッドのロジックも含まれていると見なされるので、どのアプリケーションにも読み込めます。ガベージコレクションは、Mac OS X 10.5 以降でのみサポートされます。[GCC_ENABLE_OBJC_GC, -fobjc-gc | -fobjc-gc-only]";
"[GCC_ENABLE_OBJC_GC]-value-[unsupported]" = "非対応";
"[GCC_ENABLE_OBJC_GC]-value-[supported]" = "サポートあり [-fobjc-gc]";
"[GCC_ENABLE_OBJC_GC]-value-[required]" = "必須 [-fobjc-gc-only]";

"[GCC_ONE_BYTE_BOOL]-name" = "1 バイトの‘bool‘を使用";
"[GCC_ONE_BYTE_BOOL]-description" = "‘bool’型に 1 バイト（4 バイトではなく）のサイズを使用します。[GCC_ONE_BYTE_BOOL, -mone-byte-bool]

警告：この設定を使用して生成されたコードは、この設定を使用しないで生成されたコードまたは Mac OS X フレームワークを使用して生成されたコードとのバイナリ互換性を持たないことがあります。";
"[GCC_ONE_BYTE_BOOL]-value-[NO]" = "いいえ";
"[GCC_ONE_BYTE_BOOL]-value-[YES]" = "はい";

"[GCC_DEBUGGING_SYMBOLS]-name" = "デバッグシンボルのレベル";
"[GCC_DEBUGGING_SYMBOLS]-description" = "デバッグ情報フォーマットが“スタブ”のときにデバッグシンボルのレベルを選択します。現時点では、“デフォルト”設定でオブジェクトのファイルサイズが急増するため、Xcode はデフォルトで“参照されるシンボル”設定を使用します。 [GCC_DEBUGGING_SYMBOLS]

デフォルト [-gstabs+ -feliminate-unused-debug-symbols]：コンパイラのデフォルトレベルのスタブ・デバッグシンボルを使用します。これは“参照されるシンボル”と同じです。
参照されるシンボル [-gstabs+ -feliminate-unused-debug-symbols]：デバッグシンボルは、ソースモジュールが参照するシンボルに対してのみ生成されます。
すべてのシンボル [-gstabs+ -fno-eliminate-unused-debug-symbols]：デバッグシンボルは、ソースファイルおよび含まれるヘッダファイルに存在するすべてのシンボルに対して生成されます。";
"[GCC_DEBUGGING_SYMBOLS]-value-[default]" = "デフォルト [default, -gstabs+ -feliminate-unused-debug-symbols]";
"[GCC_DEBUGGING_SYMBOLS]-value-[used]" = "参照されるシンボル [used, -gstabs+ -feliminate-unused-debug-symbols]";
"[GCC_DEBUGGING_SYMBOLS]-value-[full]" = "すべてのシンボル [full, -gstabs+ -fno-eliminate-unused-debug-symbols]";

"[GCC_ENABLE_EXCEPTIONS]-name" = "例外を有効にする";
"[GCC_ENABLE_EXCEPTIONS]-description" = "例外処理を有効にします。例外の伝達に必要な追加コードを生成します。一部の言語では、GCC がすべての関数のフレーム展開情報を生成します。これにより、データサイズが大きくなって負荷が増えることがありますが、実行には影響しません。このオプションを指定しない場合、GCC は C++ や Objective-C などの通常は例外処理を必要とする言語についてはデフォルトで例外処理を有効にし、C などの通常は例外処理を必要としない言語については例外処理を無効にします。ただし、コンパイルした C コードと、ほかの言語で記述された例外ハンドラを正しく相互運用させる必要がある場合は 、このオプションを有効にする必要があります。また、例外処理を使用しない古いプログラムをコンパイルする場合は、このオプションを無効にする必要があります。[GCC_ENABLE_EXCEPTIONS, -fexceptions]";
"[GCC_ENABLE_EXCEPTIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_EXCEPTIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_OBJC_EXCEPTIONS]-name" = "Objective-C 例外処理を有効にする";
"[GCC_ENABLE_OBJC_EXCEPTIONS]-description" = "Objective-C コードで例外を処理するための @try/@catch/@throw 構文を有効にします。これは Objective-C と Objective-C++ のみに適用されます。[GCC_ENABLE_OBJC_EXCEPTIONS, -fno-objc-exceptions]";
"[GCC_ENABLE_OBJC_EXCEPTIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_OBJC_EXCEPTIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_SYMBOL_SEPARATION]-name" = "PCH シンボルを分離";
"[GCC_ENABLE_SYMBOL_SEPARATION]-description" = "プレフィックスヘッダをプリコンパイルするときに、PCH のデバッグシンボルを含む別個のファイルを生成します。これにより、ビルド時間を改善することができます。デフォルトで、静的ライブラリ以外のプロダクトでオンになっています。このオプションは、ゼロリンクが有効になっているときは使用できません。また、“デバッグシンボルのレベル”設定が‘すべてのシンボル’（full）になっているときにのみ使用できます。このオプションは STABS のみに影響し、DWARF とは互換性がありません。  [GCC_ENABLE_SYMBOL_SEPARATION, -fsave-repository=<file>]";
"[GCC_ENABLE_SYMBOL_SEPARATION]-value-[NO]" = "いいえ";
"[GCC_ENABLE_SYMBOL_SEPARATION]-value-[YES]" = "はい";

"[GCC_AUTO_VECTORIZATION]-name" = "自動的にベクトル化";
"[GCC_AUTO_VECTORIZATION]-description" = "ループの自動ベクトル化を適用できる場合に実行します。この設定は、最適化レベルが 2 以上で、自動ベクトル化に対応したプロセッサがターゲットの場合にのみ適用されます。最適化レベルが 2 よりも低い場合、またはターゲットのプロセッサがベクトル演算に対応していない場合は、この設定は適用されません。[GCC_AUTO_VECTORIZATION, -ftree-vectorize]";
"[GCC_AUTO_VECTORIZATION]-value-[NO]" = "いいえ";
"[GCC_AUTO_VECTORIZATION]-value-[YES]" = "はい";

"[GCC_ENABLE_SSE3_EXTENSIONS]-name" = "SSE3 拡張を有効にする";
"[GCC_ENABLE_SSE3_EXTENSIONS]-description" = "SSE3 拡張命令セットの命令を使用できるようにします。Intel アーキテクチャが対象の場合のみ使用します。[GCC_ENABLE_SSE3_EXTENSIONS, -msse3]";
"[GCC_ENABLE_SSE3_EXTENSIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_SSE3_EXTENSIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_SUPPLEMENTAL_SSE3_INSTRUCTIONS]-name" = "Supplemental SSE3 命令を有効にする";
"[GCC_ENABLE_SUPPLEMENTAL_SSE3_INSTRUCTIONS]-description" = "命令セットの MMX、SSE、SSE2、およびSSE3 拡張へのアクセスを可能にする内蔵関数を使用できるようにします。Intel アーキテクチャが対象の場合のみ使用します。[GCC_ENABLE_SUPPLEMENTAL_SSE3_INSTRUCTIONS, -mssse3]";
"[GCC_ENABLE_SUPPLEMENTAL_SSE3_INSTRUCTIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_SUPPLEMENTAL_SSE3_INSTRUCTIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_SSE41_EXTENSIONS]-name" = "SSE4.1 拡張を有効にする";
"[GCC_ENABLE_SSE41_EXTENSIONS]-description" = "SSE4.1 拡張命令セットの命令を使用できるようにします。Intel アーキテクチャが対象の場合のみ使用します。[GCC_ENABLE_SSE41_EXTENSIONS, -msse4.1]";
"[GCC_ENABLE_SSE41_EXTENSIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_SSE41_EXTENSIONS]-value-[YES]" = "はい";

"[GCC_ENABLE_SSE42_EXTENSIONS]-name" = "SSE4.2 拡張を有効にする";
"[GCC_ENABLE_SSE42_EXTENSIONS]-description" = "SSE4.2 拡張命令セットの命令を使用できるようにします。Intel アーキテクチャが対象の場合のみ使用します。[GCC_ENABLE_SSE42_EXTENSIONS, -msse4.2]";
"[GCC_ENABLE_SSE42_EXTENSIONS]-value-[NO]" = "いいえ";
"[GCC_ENABLE_SSE42_EXTENSIONS]-value-[YES]" = "はい";

"[GCC_FEEDBACK_DIRECTED_OPTIMIZATION]-name" = "フィードバック最適化";
"[GCC_FEEDBACK_DIRECTED_OPTIMIZATION]-description" = "プロファイルのフィードバック最適化を有効にします。最初に‘プロファイルを生成’モードでプログラムをビルドし、標準的な方法で実行すると、プログラムが終了するときに、.o ファイルと一緒にプロファイル・トレース・ファイルが生成されます。プログラムを実行するたびに、プロファイル・トレース・ファイルにデータが追加されます。次に、‘プロファイルを使用’モードでプログラムを再ビルドします。このとき、プロファイル・トレース・ファイルの情報に基づいて、最適化に関する決定が行われます。「トレーニング」によって選択されたコードパスが、最適化後のアプリケーションで実行される標準的なパスでない場合は、不正なデータに基づいてコードが最適化されるため、実際にはパフォーマンスが低下することがあります。[GCC_FEEDBACK_DIRECTED_OPTIMIZATION, -profile-generate, -profile-use]";
"[GCC_FEEDBACK_DIRECTED_OPTIMIZATION]-value-[Off]" = "切";
"[GCC_FEEDBACK_DIRECTED_OPTIMIZATION]-value-[GenerateProfile]" = "プロファイルを生成";
"[GCC_FEEDBACK_DIRECTED_OPTIMIZATION]-value-[UseProfile]" = "最適化のためにプロファイルを使用";

"[GCC_SYMBOLS_PRIVATE_EXTERN]-name" = "デフォルトでシンボルを隠す";
"[GCC_SYMBOLS_PRIVATE_EXTERN]-description" = "有効にすると、コード内で‘__attribute__((visibility(\"default\")))’を使用して書き出すことを明示的に示さない限り、すべてのシンボルが‘private extern’で宣言されます。無効にすると、‘private extern’として明示的に示さない限り、すべてのシンボルが書き出されます。

詳しくは、<http://developer.apple.com/documentation/DeveloperTools/Conceptual/CppRuntimeEnv/Articles/SymbolVisibility.html> を参照してください。

[GCC_SYMBOLS_PRIVATE_EXTERN, -fvisibility=hidden]";
"[GCC_SYMBOLS_PRIVATE_EXTERN]-value-[NO]" = "いいえ";
"[GCC_SYMBOLS_PRIVATE_EXTERN]-value-[YES]" = "はい";

"[GCC_INLINES_ARE_PRIVATE_EXTERN]-name" = "インラインメソッドを隠す";
"[GCC_INLINES_ARE_PRIVATE_EXTERN]-description" = "有効にすると、インラインメソッドの外部のコピーが‘private extern’として宣言されます。[GCC_INLINES_ARE_PRIVATE_EXTERN, -fvisibility-inlines-hidden]";
"[GCC_INLINES_ARE_PRIVATE_EXTERN]-value-[NO]" = "いいえ";
"[GCC_INLINES_ARE_PRIVATE_EXTERN]-value-[YES]" = "はい";

"[GCC_THREADSAFE_STATICS]-name" = "静的オブジェクトはスレッドセーフ";
"[GCC_THREADSAFE_STATICS]-description" = "ローカルの静的オブジェクトのスレッドセーフな初期化のために、C++ ABI で指定されたルーチンを使用する追加のコードを発行します。スレッドセーフにする必要がないコードでは、このオプションを無効すると、コードのサイズが少し小さくなります。[GCC_THREADSAFE_STATICS, -fno-threadsafe-statics]";
"[GCC_THREADSAFE_STATICS]-value-[NO]" = "いいえ";
"[GCC_THREADSAFE_STATICS]-value-[YES]" = "はい";

"[GCC_OBJC_CALL_CXX_CDTORS]-name" = "Objective-C で C++ デフォルトコンストラクタ／デストラクタを呼び出す";
"[GCC_OBJC_CALL_CXX_CDTORS]-description" = "Objective-C クラスの C++ インスタンス変数で非自明なデフォルトコンストラクタおよびデストラクタを実行します。[GCC_OBJC_CALL_CXX_CDTORS, -fno-objc-call-cxx-cdtors]";
"[GCC_OBJC_CALL_CXX_CDTORS]-value-[NO]" = "いいえ";
"[GCC_OBJC_CALL_CXX_CDTORS]-value-[YES]" = "はい";

"[GCC_ENABLE_FIX_AND_CONTINUE]-name" = "修正して続ける";
"[GCC_ENABLE_FIX_AND_CONTINUE]-description" = "この設定を有効にする場合は、“修正して続ける”を使えるようにバイナリをビルドしてください。デバッグビルド構成では、この設定がデフォルトで有効になっており、有効／無効の切り替えはこの構成で行います。リリースビルドは“修正して続ける”でビルドしないように強くお勧めします。

この設定を有効にすると、“デフォルトでシンボルを隠す”と“位置依存コードを生成”の設定は無効になります。

[GCC_ENABLE_FIX_AND_CONTINUE, -mfix-and-continue]";
"[GCC_ENABLE_FIX_AND_CONTINUE]-value-[NO]" = "いいえ";
"[GCC_ENABLE_FIX_AND_CONTINUE]-value-[YES]" = "はい";

"[GCC_ENABLE_KERNEL_DEVELOPMENT]-name" = "カーネル開発モード";
"[GCC_ENABLE_KERNEL_DEVELOPMENT]-description" = "この設定を有効にすると、カーネル開発モードを使えるようになります。このモードでは、状況に応じて -static、-fno-common、-fno-cxa-atexit、-fno-exceptions、-fno-non-call-exceptions、-fapple-kext、-fno-weak、-fno-rtti が設定されます。このモードでは、PowerPC ターゲット用の -mno-altivec、-msoft-float、-fno-builtin、-mlong-branch も設定されます。[GCC_ENABLE_KERNEL_DEVELOPMENT, -mkernel]";
"[GCC_ENABLE_KERNEL_DEVELOPMENT]-value-[NO]" = "いいえ";
"[GCC_ENABLE_KERNEL_DEVELOPMENT]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_POINTER_SIGNEDNESS]-name" = "ポインタの符号の比較";
"[GCC_WARN_ABOUT_POINTER_SIGNEDNESS]-description" = "引数から渡されたポインタまたは変数に割り当てられたポインタの符号が異なる場合に警告します。[GCC_WARN_ABOUT_POINTER_SIGNEDNESS, -Wno-pointer-sign]";
"[GCC_WARN_ABOUT_POINTER_SIGNEDNESS]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_POINTER_SIGNEDNESS]-value-[YES]" = "はい";

"[GCC_WARN_ABOUT_MISSING_NEWLINE]-name" = "ファイルの終わりに改行がありません";
"[GCC_WARN_ABOUT_MISSING_NEWLINE]-description" = "ソースファイルが改行で終わっていない場合に警告します。[GCC_WARN_ABOUT_MISSING_NEWLINE, -Wnewline-eof]";
"[GCC_WARN_ABOUT_MISSING_NEWLINE]-value-[NO]" = "いいえ";
"[GCC_WARN_ABOUT_MISSING_NEWLINE]-value-[YES]" = "はい";

"[GCC_WARN_64_TO_32_BIT_CONVERSION]-name" = "32 ビット型への暗黙の型変換";
"[GCC_WARN_64_TO_32_BIT_CONVERSION]-description" = "値が 64 ビット型から 32 ビット型へ暗黙的に型変換が実行された場合に警告します。[GCC_WARN_64_TO_32_BIT_CONVERSION, -Wshorten-64-to-32]";
"[GCC_WARN_64_TO_32_BIT_CONVERSION]-value-[NO]" = "いいえ";
"[GCC_WARN_64_TO_32_BIT_CONVERSION]-value-[YES]" = "はい";
